app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @emails = Email.all

INSERT INTO "emails" ("question", "listener_id", "questioner_id", "sender_ids", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["question", "Favorite music"], ["listener_id", 4], ["questioner_id", 2], ["sender_ids", "{\"\",2,3}"], ["created_at", "2015-03-29 08:15:00.944083"], ["updated_at", "2015-03-29 08:15:00.944083"]]
SELECT  "emails".* FROM "emails"  ORDER BY "emails"."id" DESC LIMIT 1
---
  def create
    # Check for the listener.
    @listener = User.where(:email => params[:email][:listener_id]).first

    if @listener.nil?
      @listener = User.create(:email => params[:email][:listener_id], :password => "12345678")
    end

    # Check for the Sender
    params[:email][:sender_ids] = [""]
    params[:sender_emails].each do |sender|

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_email
      @email = Email.find(params[:id])