app/views/emails/new.html.haml

SELECT "users".* FROM "users"  ORDER BY "users"."username" ASC
---
                = f.email_field :listener_id, placeholder: "Add Listener", required: true
                =# f.collection_select :listener_id, User.order(:username),:id,:username, class: "span6"  ,placeholder: "Enter Email ID ...", height: "100", width: "50"
                .separator